[{"id":"angelus","name":"Angelus","image":"","description":"","url":""},{"id":"chezard","name":"Chézard","image":"","description":"","url":""},{"id":"chronomatic-group","name":"Chronomatic Group","image":"","description":"What is registered here as 'Chronomatic Group' is a consortium of four brands -Buren, Dubois-Depraz, Heuer and Breitling- that was created in an attempt to launch the first automatic chronograph; a project that would become known as 'Project 99' and that would lead to the Chronomatic family of calibers.\n\nAs Heuer -a noted chronograph and stopwatch specialist- noticed a drop of interest in... non-automatic watches, the company started looking for a way to create an automatic chronograph. The most viable option would be to work with an existing automatic movement as a base, with an added module for the chronograph. A suitable movement was found in Buren's microrotor movement and Heuer asked Dubois-Depraz to build a module. However, the costs was to high for Heuer, which at the time was not a big company, leading to a partnership with Breitling. When Buren was sold to Hamilton, the American brand to got a part in the project, although only some 20% of the first generation of movements were allocated to them.","url":""},{"id":"eta","name":"ETA","image":"https://watchbase.r.sizr.io/brand/md/eta-fb.png","description":"ETA SA Manufacture Horlogère Suisse has occupied a unique position in the watchmaking industry since 1793, when Fabriques d’Horlogerie de Fontainemelon was founded - one of the companies that would later make up ETA. Drawing inspiration from an unparalleled technical, industrial and human heritage, it has shaped its expertise (handed down over decades) to build the future. \n\nToday, ETA SA... Manufacture Horlogère Suisse uses this unique expertise as a foundation for the ongoing development of new industrialisation technologies to create ‘Swiss Made’ quartz and mechanical movements.\n\nIts 20 production sites, located in the foothills of Jura and the Swiss cantons of Valais and Ticino, combine the company’s full expertise in the production and assembly of movements and watches which are considered global benchmarks for their reliability and performance.","url":"http://www.eta.ch","year":"1856"},{"id":"frederic-piguet","name":"Frédéric Piguet","image":"","description":"","url":""},{"id":"isoprog","name":"IsoProg","image":"","description":"","url":"http://www.isoprog.ch"},{"id":"la-joux-perret","name":"La Joux-Perret","image":"","description":"","url":"http://www.lajouxperret.com"},{"id":"lemania","name":"Lemania","image":"https://watchbase.r.sizr.io/brand/md/lemania-4f.jpg","description":"","url":""},{"id":"miyota","name":"Miyota","image":"https://watchbase.r.sizr.io/brand/md/miyota-ba.jpg","description":"","url":"http://miyotamovement.com/"},{"id":"ronda","name":"Ronda","image":"https://watchbase.r.sizr.io/brand/md/ronda-62.png","description":"Ronda is an established Swiss-based company that has its roots in the Basel region. The company was founded by William Mosset in the area’s Waldenburg Valley in 1946, and is now headquartered in Lausen. Its specialty is quartz movement, many of which are available in either a 'Swiss Made' or 'Swiss Parts' version.\n\nOur company has expanded steadily over the years, and the Ronda Group today... includes five subsidiary operations: two production facilities in Southern Switzerland, one in the Jura region of Western Switzerland, a manufacturing facility in Thailand and a sales office in Hong Kong. All in all, Ronda employs about 2000 personnel in its Swiss and Asian operations.","url":"www.Ronda.ch"},{"id":"sellita","name":"Sellita","image":"https://watchbase.r.sizr.io/brand/md/sellita-a4.png","description":"Founded in 1950 in La Chaux-de-Fonds, Sellita has a long tradition in assembly as well as in design and manufacture of quality mechanical movements. Over the years Sellita has managed to become a vital pillar of the Swiss watchmaking industry.\n\nProduct of a strong corporate vertical structure, Sellita has in-house control over all the essential stages of the design, manufacture and assembly of... mechanical movements. Sellita has its own movement-blank factory (Gurofa) as well as its own electroplating and decoration business (Technicor). Sellita’s expertise extends even to the design and manufacture of the regulating organ, in other words, the heart of the mechanical movement.","url":"http://sellita.ch","year":"1950"},{"id":"soprod","name":"Soprod","image":"https://watchbase.r.sizr.io/brand/md/soprod-8f.jpg","description":"","url":""},{"id":"swiss-technology-production","name":"Swiss Technology Production","image":"https://watchbase.r.sizr.io/brand/md/swiss-technology-production-76.png","description":"The development of the STP1-11 basic movement began in 2006 when the company STP was established. The first movements left the factory in 2008, and production volumes soon increased significantly. Today, STP movements are used by famous Swiss watch companies.\n\nIn 2012, a semi-automated production line was set up and the production area expanded to over 1,000 m2.\n\nIn 2015, the production... process was upgraded with the addition of more fully automatic machines and robots developed by STP, enabling a further increase in production and optimising quality.\n\nBased on the STP1-11 basic movement, the STP2-12 versions with a power reserve display were developed and rolled out in 2015.\n\nFurther innovations, including the STP5-15 movement with a visible balance and the fully skeletonised STP6-15 version, followed in 2016.\n\nThe STP8-14 women's movement enjoyed great success when it was developed and marketed in 2016.\n\nMore movements are currently in the pipeline and scheduled for launch in 2017.","url":"http://www.swisstp.com/","year":"2006"},{"id":"technotime","name":"Technotime","image":"","description":"","url":""},{"id":"time-module","name":"Time Module","image":"","description":"","url":"http://www.timemodule.com"},{"id":"uhren-werke-dresden","name":"Uhren-Werke-Dresden","image":"https://watchbase.r.sizr.io/brand/md/uhren-werke-dresden-81.jpg","description":"","url":"http://www.uhren-werke.de/"},{"id":"universal-geneve","name":"Universal Geneve","image":"","description":"","url":"","year":"1894"},{"id":"unknown","name":"Unknown","image":"","description":"","url":""},{"id":"valjoux","name":"Valjoux","image":"","description":"","url":""},{"id":"vaucher","name":"Vaucher","image":"https://watchbase.r.sizr.io/brand/md/vaucher-6.jpg","description":"","url":"http://www.vauchermanufacture.ch","year":"2003"},{"id":"venus","name":"Venus","image":"","description":"","url":""}]