[
  {
    "id": "a-lange-and-sohne",
    "name": "A. Lange & Söhne",
    "image": "https://watchbase.r.sizr.io/brand/md/a-lange-soehne-56.png",
    "description": "The modern A. Lange & Söhne was founded by Walter Lange on December 7th 1990. With the help of LMH and in particular the late Günter Blümlein, walter Lange sets out to create a collection of watches to rival the likes of the Swiss Patek Philippe, Vacheron Constantin and Audemars Piguet. The inaugural collection, consisting of the Lange 1, the Arcade, the Saxonia and the Tourbillon Pour le... Mérite, is presented on October 24th 1994. The Lange 1 would grow out to be emblematic for the Glashütte-based brand; the Tourbillon Pour le Mérite an indication of the technical prowess and ambition. Notable later introductions include (but are not limited to) the Tourbograph Pour le Mérite, the Datograph, the Double Split and the Lange 31.",
    "url": "http://www.alange-soehne.com",
    "year": "1990"
  },
  {
    "id": "alexandre-meerson",
    "name": "Alexandre Meerson",
    "image": "https://watchbase.r.sizr.io/brand/md/alexandre-meerson-50.png",
    "description": "The son of a renowned watch and jewelry designer, Alexandre Meerson grew up in France with a passion for horology, fashion and design. He was involved in the family business from an early age, after which he went on to work for some of the most iconic names in the world of luxury. His passion for luxury and horology drove him to set up his own label in 2011, perpetuating a family tradition in... watchmaking that began in the 1950s. Alexandre presented his first watch collection in 2014.",
    "url": "http://www.meerson.com"
  },
  {
    "id": "anonimo",
    "name": "Anonimo",
    "image": "https://watchbase.r.sizr.io/brand/md/anonimo-79.png",
    "description": "The three basic principles were supplemented by a few more values : elegance and excellence. On the strength of its patented inventions, Anonimo launched several other product lines, including the emblematic \"Militare\", featuring the famous crown screw-in locking system and completely water resistant push-buttons.\n\nSince 1997, different entities, different personalities staying true to its... original philosophy, a watch should not be worn as a “brand status” but as the expression of the personality of the wearer.\n\nWith an aestheticism inspired by Italian elegance, an Anonimo watch expresses both robustness and functionality through its distinctive design and solid case. The values of originality, seriousness and closeness carry across the two decades. This feeling is reinforced by the careful choice of materials, such as treated or stainless steel or bronze, an element that the brand was one of the first users in watchmaking, and that is still included in each of its lines.",
    "url": "https://www.anonimo.com/"
  },
  {
    "id": "apple",
    "name": "Apple",
    "image": "https://watchbase.r.sizr.io/brand/md/apple-d.png",
    "description": "",
    "url": "https://www.apple.com",
    "year": "1976"
  },
  {
    "id": "archimede",
    "name": "Archimede",
    "image": "https://watchbase.r.sizr.io/brand/md/archimede-e7.png",
    "description": "",
    "url": "https://www.archimede-watches.com"
  },
  {
    "id": "armand-nicolet",
    "name": "Armand Nicolet",
    "image": "https://watchbase.r.sizr.io/brand/md/armand-nicolet-d1.jpg",
    "description": "",
    "url": ""
  },
  {
    "id": "armin-strom",
    "name": "Armin Strom",
    "image": "https://watchbase.r.sizr.io/brand/md/armin-strom-71.png",
    "description": "",
    "url": "http://www.arminstrom.com",
    "year": "1983"
  },
  {
    "id": "arnold-and-son",
    "name": "Arnold & Son",
    "image": "https://watchbase.r.sizr.io/brand/md/arnold-son-69.jpg",
    "description": "",
    "url": "http://www.arnoldandson.com",
    "year": "1995"
  },
  {
    "id": "audemars-piguet",
    "name": "Audemars Piguet",
    "image": "https://watchbase.r.sizr.io/brand/md/audemars-piguet-60.jpg",
    "description": "",
    "url": "http://www.audemarspiguet.com",
    "year": "1875"
  },
  {
    "id": "ball-watch",
    "name": "Ball Watch",
    "image": "https://watchbase.r.sizr.io/brand/md/ball-watch-d5.jpg",
    "description": "To a large extent, the development of the watch industry in America can be attributed to the advent and subsequent development of American railroads.  Prior to the advent of trains as a means of transporting people and goods, there was no real need for precise timekeeping or uniform time.  Even after the railroad system in the United States had reached significant proportions following the Civil... War, communities continued to maintain their local times.  By the end of 1883, the railroad industry had agreed, at least among themselves, to divide the nation into four time zones and had adopted Standard Time. The public soon followed suit, although it is interesting to note that the Congress did not officially sanction the concept until 1918. In 1996, Cleveland, Ohio, celebrated the bicentennial of the founding of the city on the lake.  During this celebration, many individuals were remembered and recognized as Cleveland's favorite sons, and their accomplishments were reviewed.  One Clevelander honored, whose accomplishments reached international acclaim, not only for his civic contributions, but also for his place in horology, was Webster Clay Ball. Webb C. Ball was born in Fredericktown, Ohio on October 6, 1847.  When Standard Time was adopted in 1883, he was the first jeweler to use time signals, bringing accurate time to Cleveland. On July 19, 1891, the General Superintendent of Lake Shore Lines appointed Webb C. Ball as Chief Inspector for the lines.  His early inspection system was the beginning of the vast Ball network that would encompass 75% of the railroads throughout the country and cover at least 175,000 miles of railroad. Webb C. Ball also extended his system into Mexico and Canada.\n\nOn April 19, 1891 the Fast Mail train known as No. 4 was coming west on the Lake Shore & Michigan Southern Railroad in Kipton, Ohio. At Elyria, 25 miles from Cleveland, the Engineer and the Conductor of the Accomodation were given orders to let the fast mail train pass them at Kipton, a small station west of Oberlin, the University town. As the Conductor of Accomodation admitted afterward, from the time the train left Elyria until it collided with the Fast Mail at Kipton, he did not take his watch out of his pocket. He said that he supposed the Engineer would look out for Fast Mail No. 4. But the Engineer's watch stopped for four minutes and then began running again, a little matter of life and death of which he was unconscious.  There were several stations between Elyria and Kipton, but the Engineer pounded slowly along in the belief that he had time to spare.  Leaving Oberlin, the Engineer supposed he had seven minutes before reaching the meeting point.  Of course he only had three minutes.  Had the Conductor looked at his own watch he could have prevented the accident.  The trains came together at Kipton, the Fast Mail at full speed and the Accomodation under brakes, because it was nearing the station.  The Engineers of both trains were killed, and the dead bodies of nine clerks were taken from the kindling wood and broken iron of the postal cars.\n\nThe Kipton Disaster prompted the Lake Shore officials to enlist Webb C. Ball to investigate Time and Watch conditions throughout the Lake Shore Line and develop an inspection system for their implementation.  Webb C. Ball set about immediately and put in place fortnightly checks on the watches worn by all railroad workers.  The checks were carried out by approved watchmakers. Ball set strict standards, forbidding variations more than 30 seconds among the watches.  It is important to recognize and applaud Webb C. Ball for designing the first successful system that was accepted on a broad scale.  It was his system that set the standard for railroads; it was his system that helped establish accuracy and uniformity in timekeeping.  It was his system that resulted in railroad time and railroad watches being recognized as STANDARD, whenever accuracy in time was required.  In general, it became accepted that when the average person asks a railroad man the time, he is assured a correct answer.\n\nToday, BALL Watch is one of the most respected and established watch brands in the United States.  The brand continues to update the product range in the 21st century to keep pace with shifting consumer patterns.  But, despite changes in appearance, the founding spirit of Ball - industrial function - is never compromised.  It is upheld in Ball's original details, such as the watch dial that faithfully follows his design guidelines for the standard railway watch.  Every detail, from the shape of the hands to the style of the numerals, was laid down by the founder in his quest for accuracy in timekeeping.  It is a vision that the Ball family remains faithful to. For legions of men and women today whose split-second decisions keep the world ticking, it is a shared commitment.",
    "url": "http://www.ballwatch.com"
  },
  {
    "id": "bastian-antoni",
    "name": "Bastian Antoni",
    "image": "https://watchbase.r.sizr.io/brand/md/bastian-antoni-5c.jpg",
    "description": "",
    "url": "https://www.bastianantoni.com/"
  },
  {
    "id": "baume-and-mercier",
    "name": "Baume & Mercier",
    "image": "https://watchbase.r.sizr.io/brand/md/baume-mercier-d2.jpg",
    "description": "",
    "url": "http://www.baume-et-mercier.com",
    "year": "1830"
  },
  {
    "id": "bell-and-ross",
    "name": "Bell & Ross",
    "image": "https://watchbase.r.sizr.io/brand/md/bell-ross-d9.png",
    "description": "",
    "url": "http://www.bellross.com",
    "year": "1992"
  },
  {
    "id": "bereve",
    "name": "Bereve",
    "image": "https://watchbase.r.sizr.io/brand/md/bereve-f9.png",
    "description": "Bereve claims to be an independent brand of Haute Horlogerie, which fosters all the values of the Swiss watchmaking art. The handcraft of the dials and the manufacturing of all the components are said to reveal the high quality of its 100% Swiss Made timepieces. The company argues it has long experience in designing and making dials with the “Grand Feu” technique (including Champlevé,... Coisonné, Plique Jour, Miniature). Bereve combines different techniques, such as Micromosaic in spun enamel, with the most precious and unique decorative stones and minerals in the world. This fifty-year-old savoir-faire enabled the company to enhance its creativity and go beyond the limits of regular handcrafting techniques.",
    "url": "https://bereve.ch"
  },
  {
    "id": "blancpain",
    "name": "Blancpain",
    "image": "https://watchbase.r.sizr.io/brand/md/blancpain-70.png",
    "description": "",
    "url": "http://www.blancpain.com",
    "year": "1735"
  },
  {
    "id": "breguet",
    "name": "Breguet",
    "image": "https://watchbase.r.sizr.io/brand/md/breguet-c6.png",
    "description": "",
    "url": "http://www.breguet.com",
    "year": "1775"
  },
  {
    "id": "breitling",
    "name": "Breitling",
    "image": "https://watchbase.r.sizr.io/brand/md/breitling-f9.jpg",
    "description": "Breitling was founded in 1884. The brand counts among its earliest achievements the invention of the independent chronograph pushpiece in 1915 and the separation of the start/stop functions from that of resetting in 1923.\n\nThe connection of Breitling with the world of aviation is said to have taken off in the early 1930's, when the brand started creating onboard chronographs intended for... aircraft cockpits. With the introduction of the Navitimer in the first half of the 1950's, Breitling had created what would prove to be one of the most iconic and everlasting pilots watch designs yet: the model hasn't been out of production since. A variation of this model accompanied Scott Carpenter on his orbital flight aboard the Aurora 7 capsule in 1962.\n\nIn the sixties, Breitling was part of the 'Project 99' consortium that was created with the aim of creating the first self-winding chronograph movement - the one that would become the caliber 11. Although the so-called 'Quartz Crisis' had hit Breitling hard, the brand would be one of the first to launch a completely new mechanical chronograph in the mid-eighties: the Chronomat. This watch would become another icon for Breitling and would serve as a catalyst for the industry as a whole. Besides the Navitimer and the Chronomat, the Emergency is arguably the third most emblematic model - featuring a never-before-seen transmitter system that couldn't have been conceived by any other brand than Breitling.\n\nThe 2009 introduction of the caliber 01 gave Breitling a in-house chronograph movement and it would serve as the base for a number of variations over the next few years.\n\nBreitling is the only company of this scale to submit 100% of its movements for COSC-certification, including the quartz calibers.",
    "url": "http://www.Breitling.com",
    "year": "1884"
  },
  {
    "id": "bremont",
    "name": "Bremont",
    "image": "https://watchbase.r.sizr.io/brand/md/bremont-30.jpg",
    "description": "The Bremont watch brand was founded in 2002 by Nick and Giles English. Sharing a passion for both aviation as well as horology, the British brothers set out to create beautifully crafted pilot’s watches of exceptional quality. Bremont watches are hand built in limited numbers, are powered by mechanical movements (the majority COSC-certified) and are tested beyond the normal call of duty.... Bremont also has a very tight working relationship with the military, having developed bespoke mechanical chronometers for multiple squadrons around the world",
    "url": "http://www.bremont.com"
  },
  {
    "id": "breva",
    "name": "Breva",
    "image": "https://watchbase.r.sizr.io/brand/md/breva-58.png",
    "description": "Exceedingly unusual and innovative complications - that's Breva in a nutshell.\n\nBreva Genève founder, Vincent Dupontreué, was born just outside Paris in 1977. He had a precocious entrepreneurial spirit that had him making and selling bracelets on the beach in Corsica during holidays when just 11 years old and at 13 building and selling skateboard ramps with his brother. A job working in a... bespoke men’s clothing store at 18 led, a few years later, to the position of sales manager at Ermenegildo Zegna. Vincent Dupontreué quickly decided he wanted to run his own boutique and when that wasn’t a possibility – he was still only 22 years old – he set up his own fashion brand, called “Vincent Dupontreué”.\n\nAfter seven successful years Vincent Dupontreué sold his fashion brand, completed an MBA in Lausanne, Switzerland, and ran an art gallery for a couple of years.\n\nOn his 33rd birthday in 2010, a desire for a nice watch ignited his entrepreneurial spirit once again and he decided to launch his own high-end Swiss brand. A beautiful weekend on Lake Como in Northern Italy provided both the inspiration for the name, Breva – ‘La Breva’ is a warm southern wind contributing to the agreeably mild micro-climate around Lake Como – and the idea of creating a mechanical timepiece that forecast the weather.\n\nAfter 3 years of research and development, at Baselworld 2013 Breva launched its first groundbreaking timepiece – the Génie 01, the world’s first mechanical wristwatch with time, barometer for forecasting the weather, altimeter and power reserve indications.\n\nAt Baselworld 2014, the brand launched it second creation – the Génie 02 – a fully functional, high performance mechanical altimeter.\n\nBreva Genève demonstrates a radical, innovative vision of high-end watchmaking with its complications. Attached to the concept of “monitoring your environment” and driven by the spirit of innovation, Breva is the link between watchmaking tradition and modernity – developing an innovative movement with a timeless design.",
    "url": "http://breva-watch.com"
  },
  {
    "id": "bulgari",
    "name": "Bulgari",
    "image": "https://watchbase.r.sizr.io/brand/md/bulgari-ad.jpg",
    "description": "",
    "url": "http://www.bulgari.com",
    "year": "1884"
  },
  {
    "id": "cartier",
    "name": "Cartier",
    "image": "https://watchbase.r.sizr.io/brand/md/cartier-fe.png",
    "description": "Cartier was founded in Paris in 1847 by master jeweler Louis Francois Cartier. His son Alfred took over in 1874, but it would be the grandsons Louis, Pierre and Jacques lay the foundation for to building the brand into what it is today. The company would remain in hands of the family until 1972.\n\nWhile primarily a jewelry brand, Cartier has a rich and deep history when it comes to watches. It... introduced its ladies wristwatch well before the end of the 19th century, while the first men's watch was designed in 1904 at the request of famous aviator Alberto Santos-Dumont. The latter would serve as the inspiration for the 1911 Santos wristwatch, one of many icons of the Parisian brand.",
    "url": "http://www.cartier.com/",
    "year": "1847"
  },
  {
    "id": "casio",
    "name": "Casio",
    "image": "https://watchbase.r.sizr.io/brand/md/casio-67.png",
    "description": "In 1946, Tadao Kashio founded a company called Kashio Seisakujo, in Mitaka, Tokyo. One of his earliest innovations was some kind of ring that held a cigarette, allowing its wearer to smoke the cigarette until its very end – with Japan impoverished from WWII, this innovation was quite a success. Tadao Kashio, now joined by his brothers Toshio, Kazuo and Yukio, would go on and invest the proceeds... in the development of electronic calculators, of which the first prototype was shown by in 1954. In 1957 the first commercially available electronic calculator was introduced by the company, at which time Casio Computer Co., Ltd. is established.",
    "url": "http://www.casio.com",
    "year": "1946"
  },
  {
    "id": "certina",
    "name": "Certina",
    "image": "https://watchbase.r.sizr.io/brand/md/certina-ba.jpg",
    "description": "",
    "url": "http://www.certina.com",
    "year": "1888"
  },
  {
    "id": "chopard",
    "name": "Chopard",
    "image": "https://watchbase.r.sizr.io/brand/md/chopard-a0.jpg",
    "description": "Passion and innovation are the hallmarks of Chopard's philosophy, reflected in each unique creation of the L.U.C collection. On the inside or from the outside, each timepiece is the ultimate expression of beauty and the peak of watch-making art.\n\nIn 1921, the founder’s son, Paul Louis Chopard, opened a branch in La Chaux-de-Fonds and then relocated the company headquarters there. In 1937, he... moved the firm to Geneva, the capital of Haute Horlogerie, or Fine Watchmaking, thereby bringing it closer to its cosmopolitan clientele. In 1943, Paul André Chopard, grandson of Louis-Ulysse, took the helm.\n\nIn 1963 he sought a buyer capable of reviving and perpetuating the brand’s rich heritage, since none of his sons wished to take over the company. This was when he met Karl Scheufele, descendant of a dynasty of watchmakers and jewellers from Pforzheim, Germany.\n\nAfter a brief meeting, Karl Scheufele decided to buy the company. Under the impetus of the Scheufele family, Chopard experienced spectacular development. Renowned for its creativity, its state-of-the-art technology and the excellence of its craftsmen, it became one of the leading names in the high-end watch and jewellery industry. Entirely independent, Chopard is pursuing a time-honoured family tradition. Karl Scheufele and his wife Karin have orchestrated the company’s international expansion for more than 40 years and are still active in the firm. Their two children are its current co-presidents: Caroline Scheufele is responsible for the ladies’ collections and high jewellery, while her brother Karl-Friedrich Scheufele manages the gents' collections and the Chopard Manufacture in Fleurier, the production site of L.U.C movements.",
    "url": "www.Chopard.com",
    "year": "1860"
  },
  {
    "id": "christiaan-van-der-klaauw",
    "name": "Christiaan van der Klaauw",
    "image": "https://watchbase.r.sizr.io/brand/md/christiaan-van-der-klaauw-72.png",
    "description": "",
    "url": "http://www.klaauw.com",
    "year": "1974"
  },
  {
    "id": "christopher-ward",
    "name": "Christopher Ward",
    "image": "https://watchbase.r.sizr.io/brand/md/christopher-ward-fa.jpg",
    "description": "",
    "url": "www.christopherward.eu",
    "year": "2004"
  },
  {
    "id": "citizen",
    "name": "Citizen",
    "image": "https://watchbase.r.sizr.io/brand/md/citizen-d5.jpg",
    "description": "",
    "url": "http://www.citizenwatch-global.com/",
    "year": "1918"
  },
  {
    "id": "code41",
    "name": "CODE41",
    "image": "https://watchbase.r.sizr.io/brand/md/code41-13.png",
    "description": "",
    "url": "https://code41watches.com/"
  },
  {
    "id": "corum",
    "name": "Corum",
    "image": "https://watchbase.r.sizr.io/brand/md/corum-d1.png",
    "description": "",
    "url": "",
    "year": "1955"
  },
  {
    "id": "crafter-blue",
    "name": "Crafter Blue",
    "image": "https://watchbase.r.sizr.io/brand/md/crafter-blue-a1.png",
    "description": "",
    "url": "https://www.crafterbluewatches.com/"
  },
  {
    "id": "cuervo-y-sobrinos",
    "name": "Cuervo y Sobrinos",
    "image": "https://watchbase.r.sizr.io/brand/md/cuervo-y-sobrinos-39.png",
    "description": "",
    "url": "www.cuervoysobrinos.com",
    "year": "1882"
  },
  {
    "id": "czapek",
    "name": "Czapek",
    "image": "https://watchbase.r.sizr.io/brand/md/czapek-51.png",
    "description": "",
    "url": "http://czapek.com"
  },
  {
    "id": "d-dornblueth-and-sohn",
    "name": "D. Dornblueth & Sohn",
    "image": "https://watchbase.r.sizr.io/brand/md/d-dornblueth-sohn-fb.jpg",
    "description": "",
    "url": "http://www.dornblueth.com",
    "year": "1962"
  },
  {
    "id": "d-malchert",
    "name": "D. Malchert",
    "image": "https://watchbase.r.sizr.io/brand/md/malchert-uhren-6a.jpg",
    "description": "",
    "url": "http://malchert-uhren.de/"
  },
  {
    "id": "damasko",
    "name": "Damasko",
    "image": "https://watchbase.r.sizr.io/brand/md/damasko-7f.jpg",
    "description": "The history of Damasko Ltd. begins with a childhood dream of Konrad Damasko to construct a mechanical watch to require very little maintenance while being extremely robust.\n\nKonrad Damasko realized this dream together with his wife Petra Damasko with the establishment of the Damasko Collection in 1994. In the meantime, they are also supported by their children - Nadja, Christoph and Isabella.... From the very beginning, the focus was on the creation of meaningful innovations through a profound and uncompromising re-design of the timepiece with all its control elements.\n\nRight at the outset Konrad Damasko filed the first groundbreaking patent for hardenable stainless steels. The story runs its course from this moment on and can be read as a small miracle showing how the love for precision engineering evolved into a leading technology company with countless technical inventions to its name. Konrad Damasko developed a lubricant-free escapement by means of nano-technology based coatings using DLC (Diamond Like Carbon), a double eccentric ratchet winding system with low-friction ceramic ball bearings. This increases the longevity of the winding while also making it extremely low-maintenance. To fulfill the wish that the watch speed be made as accurate as possible, he tested oils for extreme temperature ranges so as to withstand both freezing temperatures and Sahara-like conditions. With the development of a spring and an escapement of polycrystalline silicon, the watch has become even more accurate and possesses its own protective shield against shocks, centrifugal- and gravitational forces. The grand finale is the midsize company’s start and successful completion of its own movement.\n\nThe year 2010 sees the completion of the first DAMASKO automatic movement named A35 – 1, integrating all previous technologies. From this point on, the family business ascends into the circle of manufacturers and boasts a vertical range of manufacture up to 90% for manufactory models. To do justice to this title, yet another masterpiece, the manual winding movement H35, ensued. Both movements boast beautiful decorative finishing – cock and bridges are provided with Geneva stripes. The base plate is circular-grained and also rhodium-plated. The winding wheels shine with a sun-brushed finish.\n\nSince 2013, DAMASKO Collection and DAMASKO Metallverarbeitung are now called DAMASKO GmbH, with the registered trademark “Damasko Uhrenmanufaktur”.\n\nDAMASKO GmbH strives to be one of the leading companies in the fields of research and implementation of new materials, processes and individual solutions in the watch industry.",
    "url": "http://www.damasko-watches.com",
    "year": "1994"
  },
  {
    "id": "dan-henry",
    "name": "Dan Henry",
    "image": "https://watchbase.r.sizr.io/brand/md/dan-henry-15.png",
    "description": "",
    "url": "https://danhenrywatches.com"
  },
  {
    "id": "de-bethune",
    "name": "De Bethune",
    "image": "https://watchbase.r.sizr.io/brand/md/de-bethune-53.jpg",
    "description": "De Bethune was founded in 2002 by David Zanetta and Denis Flageollet. De Bethune draws its nurture and inspiration from several centuries of history in forging its vision of 21st century watchmaking art, profoundly rooted in contemporary culture. A pioneer in the use of titanium and silicon withing the watch industry, De Bethune has acquired perfect mastery in this field, ably combining... state-of-the-art manufacturing technologies with fine traditional skills.",
    "url": "http://www.debethune.ch",
    "year": "2002"
  },
  {
    "id": "defakto",
    "name": "Defakto",
    "image": "https://watchbase.r.sizr.io/brand/md/defakto-f6.jpg",
    "description": "Founded in 2009 by Raphael Ickler, DEFAKTO is a brand with a clear mission. To create watches with a minimalist aesthetic that change how we interact with time.\n \nDEFAKTO is manufactured in Pforzheim, Germany, by the Ickler family, who has been creating precision timepieces of high quality since 1924. The design of our watches recall the teachings of the Bauhaus while maintaining a strong... contemporary aesthetic, for a timeless design. Since the beginning of 2013 the brand is based in Berlin with its new office at Brückenmeisterei, Seestraße 131, 13353 Berlin.\n \nThe original single hand automatic watch, the DEFAKTO EINS, achieved the DEFAKTO philosophy by motivating the user to accept telling time in larger intervals and at a slower pace, thus creating a more relaxed flow through the day.\n \nFollowing the success of the one hand watch DEFAKTO EINS, the two handed wristwatch DEFAKTO AKKORD was released in 2011. This timepiece continues the graphic simplicity that is at the core of the puristic DEFAKTO watch design. Lines and rectangles of exacting proportions come together to create visual coherency, leading to an aesthetic that is distinct and versatile. If one hand is not enough, the DEFAKTO AKKORD can provide.\n \nIn 2012 the DEFAKTO DETAIL was born. This ultraflat 6.6 mm single hand watch has a more detailed scale, also showing the 5 minute phases. Looking to the dial of the watch all indexes have the same linewight and double their length according to the represented dimension of time in 5, 15 and 60 minute steps. \n \nThe brands three-hand watch - the DEFAKTO STRUKTUR - comes along with a characteristically scaled dial and the acclaimed ultra flat 6.6 mm stainless steel case. Due to its relation to the Detail one-hand watch the Struktur provides puristic lines and shapes for an modern yet classic minimal design. \n \nSimple geometries and precise proportions make certain that our puristic watches will have a timeless appeal that you will enjoy as much today as in future.",
    "url": "http://www.defakto-uhren.de/",
    "year": "2009"
  },
  {
    "id": "dietrich",
    "name": "Dietrich",
    "image": "https://watchbase.r.sizr.io/brand/md/dietrich-8b.png",
    "description": "",
    "url": "http://www.dietrich.luxury"
  },
  {
    "id": "eterna",
    "name": "Eterna",
    "image": "https://watchbase.r.sizr.io/brand/md/eterna-1a.png",
    "description": "",
    "url": "www.eterna.com",
    "year": "1856"
  },
  {
    "id": "fiona-kruger",
    "name": "Fiona Krüger",
    "image": "https://watchbase.r.sizr.io/brand/md/fiona-kruger-91.jpg",
    "description": "Fiona Krüger is a young Scottish Designer with a passion for craftsmanship and a fascination with mechanical watch movements. She designs all her watches herself, drawing inspiration from the traditions and heritage of haute horlogerie, whilst bringing a new and more artistic approach thanks to her Fine Art background and design training. \n\nBeing an independent designer with an international... upbringing has allowed Fiona to develop watches which are truly different without compromising on her design ideas.\n\nCollaboration is key to Fiona's work - she believes finding the right people to create her timepieces is as important as the design itself. \n\nDeveloping strong personal relationships is important to her - the better her suppliers understand the project and the more they care, the better the end result. Traditional skills and new technology are combined in the making of her watches - the machines help to ensure accuracy and technical requirements while the artisans bring soul to each design with their hand-work.\n\nIt's important to Fiona that her customers understand how their watch is made and by whom. This way they not only know what they are buying but can appreciate the skill involved in its production. She keeps her clients updated throughout the manufacturing of their piece with regular emails and photos.\n\nFiona visits the suppliers and artisans throughout the development and production of her pieces. It is through this on-going dialogue that Fiona ensures the highest quality for her watches.",
    "url": "http://www.fionakrugertimepieces.com"
  },
  {
    "id": "formex",
    "name": "Formex",
    "image": "https://watchbase.r.sizr.io/brand/md/formex-34.png",
    "description": "Formex Swiss Watches, established in 1999, is an independent family-owned watch manufacturer based in Biel/Bienne - known as the cradle of Swiss watchmaking. With its roots in high-end watch manufacturing, Formex develops and produces watches that meet the highest quality standards in the industry, and equip them with unique engineered features to add more functionality and comfort. Through an... innovative distribution model, Formex offers an affordable luxury watchmaking experience for those who appreciate fine timepieces and exceptional craftsmanship.",
    "url": "formexwatch.com",
    "year": "1999"
  },
  {
    "id": "fortis",
    "name": "Fortis",
    "image": "https://watchbase.r.sizr.io/brand/md/fortis-9d.gif",
    "description": "",
    "url": "http://www.fortis-swiss.com/",
    "year": "1912"
  },
  {
    "id": "fp-journe",
    "name": "FP Journe",
    "image": "https://watchbase.r.sizr.io/brand/md/fp-journe-e5.png",
    "description": "The F.P.Journe Manufacture was created relying on a unique principle: innovate and uphold, if not out-rival the high standards of Haute Horology. It makes a point of honor to design and manufacture its mechanical watches one by one and in small series. Constantly seeking perfection, the Manufacture is a world in itself, embodying excellence, know-how and innovation, values that are so dear to... enthusiasts of outstanding watches. François-Paul Journe, master-watchmaker, made every effort to verticalize his production and thus offer timepieces with an authentic manufacture caliber.\n\nBut this success is the result of more than 30 years of research and outstanding watchmaking, as well as 13 years of efforts and daily tireless work to place his Haute Horology manufacture as benchmark among the most prestigious watch companies. In a historic building dating back from 1892, a sacred place of creation, the 2,000 sq m Geneva Manufacture is organised on three floors. Each year no more than 900 precision chronometers are manufactured here, with a team of specialized watchmakers and artisans, proud to work with a creator whose office is also his workbench.\n\nThis vision of watchmaking without the slightest compromise, that associates mechanical innovation and quest for precision while respecting tradition, gave birth to new mechanisms such as the Chronomètre à Résonance, the Sonnerie Souveraine, the Tourbillon Souverain with remontoire and dead-beat second or the ultra slim Répétition Souveraine. These pieces of watchmaking art earned F.P.Journe the world’s most prestigious horological awards.\n\nThus, the developments of François-Paul Journe, often called the Abraham-Louis Breguet of modern times, are tested one by one in order to check their reliability and are always elaborated through his care, with his magnifying glass on, tweezers, screwdriver and file in his hands. These inventions, with the label Invenit et Fecit engraved on the dials and 18K rose Gold movements – hallmark of authenticity and pledge of quality – remind of the importance of a caliber designed, constructed and assembled solely in the workshops of the Manufacture. As a matter of fact, in the 18th century this inscription used to be engraved on watches manufactured by prestigious French master-watchmakers upon their acceptance by the Royal Academy of Sciences.",
    "url": "http://www.fpjourne.com",
    "year": "1999"
  },
  {
    "id": "franck-muller",
    "name": "Franck Muller",
    "image": "https://watchbase.r.sizr.io/brand/md/franck-muller-b8.png",
    "description": "t was at the end of the 80s, in the city of Geneva, that two men, Franck Muller and Vartan Sirmakes, met. They shared a passion for watchmaking each of them with vast complementary experience in the field.  At the time, Franck Muller was making his own models under the \"Franck Geneva\" brand.\n\nSince 1986, each year he has presented his World Premiers based on prestigious complications, which... earned him the sobriquet of watchmaking genius. As for Vartan Sirmakes, he made cases for several fine watchmaking brands in a workshop he had set up in a district of Geneva alongside Lake Geneva.\n\nIn 1991, Franck called on Vartan to design his new case bodies. This is how the two men quickly realised that together their could allow them to create an exceptional brand - unbeknownst to them that, 20 years later, it would become one of the most reputable names in the world of watchmaking.\n\nFounded officially in 1991 in the village of Genthod, close to Geneva, Manufacture Franck Muller was established three years later, still in Genthod, in a mansion dating from 1905 and designed by the famous local architecht Edmond Fatio. This peaceful place of 16 hectares overlooking Lake Geneva and Mont Blanc then became more than just a production site; it turned into the concept called Watchland.\n\nAt the start of the 90s, the Swiss watchmaking industry was in the midst of a crisis, and most companies gave up when confronted with the emergence of the quartz movement. It was therefore highly audacious to go against the trend and focus exclusively on mechanical watches with complications. \n\nAt the time it was almost unthinkable to acquire credibility amidst the large watchmaking houses that have been present in the market for several centuries. The watchmaking industry, and in particular the Fine Watchmaking segment, was bound by tradition and consequently not very open to innovation, especially in terms of design. So it was a bold move to introduce the case shape known as the Cintrée Curvex™, something previously nonexistent in the market: a curved body with 3 dimensions involving great technical difficulty in production. Introducing dials in bright colours such as royal blue was also a first and revolutionary step in the world of Fine Watchmaking.\n\nTo have the freedom to produce unique models, be reactive and be able to offer customers shorter time frames and better quality, the Franck Muller Group has devoted itself, for several years now, to controlling the different stages of production.\n\nThanks to this industrial verticalisation, the brand can push the barriers of watchmaking even further with an innovative spirit and great technique whilst fully respecting the Swiss watchmaking tradition. Starting new fashions instead of following them is thus made possible thanks to its independence and autonomy in the various production processes that sustain the company's unrivalled creativity.\n\nIn less than 20 years, the watchmaking brand has gained worldwide renown characterised by spectacular growth, enviable financial soundness and the production of 40,000 watches per year. Today the brand has 6 production sites in Switzerland, more then 500 employees in Switzerland. Globally there are 48 exclusive shops and 600 points of sale in more than 100 countries.\n\nIts success and fame has been built on its exceptional collections: from the Crazy Hours or the Vegas,models with fun complications, to the Aeternitas Mega - the most complicated wrist watch in the world with 36 complications and 1,483 components - as far as large complications are concerned. This last watch only reinforces the brand's label as the Master of Complications.\n\nFranck Muller and Vartan Sirmakes have managed to transform what had started only as a \"boutique brand\" into a truly major success. The association of an original design with a complex traditional mechanism gives the Franck Muller collections a harmony that has charmed the entire world ever since its incredible inception and enviable success.",
    "url": "https://www.franckmuller.com",
    "year": "1991"
  },
  {
    "id": "frederique-constant",
    "name": "Frederique Constant",
    "image": "https://watchbase.r.sizr.io/brand/md/frederique-constant-49.png",
    "description": "",
    "url": "http://www.frederique-constant.com",
    "year": "1988"
  },
  {
    "id": "girard-perregaux",
    "name": "Girard-Perregaux",
    "image": "https://watchbase.r.sizr.io/brand/md/girard-perregaux-36.png",
    "description": "",
    "url": "http://www.girard-perregaux.com",
    "year": "1791"
  },
  {
    "id": "giuliano-mazzuoli",
    "name": "Giuliano Mazzuoli",
    "image": "https://watchbase.r.sizr.io/brand/md/giuliano-mazzuoli-b0.png",
    "description": "",
    "url": "http://www.giulianomazzuoli.it/"
  },
  {
    "id": "glashutte-original",
    "name": "Glashütte Original",
    "image": "https://watchbase.r.sizr.io/brand/md/glashuette-original-66.png",
    "description": "With the reunification of Germany in 1990 came the transformation of VEB Glashütter Uhrenbetriebe into the Glashütter Uhrenbetrieb GmbH. The company is the official legal heir to all formerly independent watch companies extant in Glashütte up to 1951. Since 1994 the brand name “Glashütte Original” has stood for fine German watchmaking with a high degree of production depth.\n\nIn 2000... Glashütte Original was honoured for the first time with the much sought-after title of “Watch of the Year”: Readers of the trade publication “Armbanduhren” and the “Welt am Sonntag” newspaper put the classic Senator “Perpetual Calendar” in first place. In October the Manufactory joined the Swatch Group Ltd., an important step for the growth of the locally renowned brand into a global luxury brand.",
    "url": "http://www.glashuette-original.com",
    "year": "1994"
  },
  {
    "id": "glycine",
    "name": "Glycine",
    "image": "https://watchbase.r.sizr.io/brand/md/glycine-62.jpg",
    "description": "",
    "url": "http://glycine-watch.ch/"
  },
  {
    "id": "graham",
    "name": "Graham",
    "image": "https://watchbase.r.sizr.io/brand/md/graham-9e.jpg",
    "description": "",
    "url": "http://www.graham1695.com",
    "year": "1995"
  },
  {
    "id": "grand-seiko",
    "name": "Grand Seiko",
    "image": "https://watchbase.r.sizr.io/brand/md/grand-seiko-8f.png",
    "description": "",
    "url": "www.grand-seiko.com/"
  },
  {
    "id": "gronefeld",
    "name": "Grönefeld",
    "image": "https://watchbase.r.sizr.io/brand/md/gronefeld-e0.jpg",
    "description": "The Grönefeld family has a history spanning for more than a hundred years in watchmaking. Bart and Tim Grönefeld are the third generation to continue the family tradition, which was founded by Johan Grönefeld in 1912. After a long career working for the most prestigious Swiss watch manufacturers, the Grönefeld brothers presented their first watch, a Tourbillon Minute Repeater, in 2008. They... followed this in 2010 with their award-winning One Hertz, first in-house developed caliber. Grönefeld timepieces stand out for the innovation of their technical features, the clarity of their design and the excellence of their craftsmanship",
    "url": "http://www.gronefeld.com"
  },
  {
    "id": "h-moser-and-cie",
    "name": "H. Moser & Cie",
    "image": "https://watchbase.r.sizr.io/brand/md/moser-a.jpg",
    "description": "",
    "url": "http://www.h-moser.com",
    "year": "2005"
  },
  {
    "id": "hamilton",
    "name": "Hamilton",
    "image": "https://watchbase.r.sizr.io/brand/md/hamilton-c0.jpg",
    "description": "",
    "url": "http://www.hamiltonwatch.com",
    "year": "1892"
  },
  {
    "id": "harry-winston",
    "name": "Harry Winston",
    "image": "https://watchbase.r.sizr.io/brand/md/harry-winston-52.png",
    "description": "",
    "url": "http://www.harrywinston.com",
    "year": "1990"
  },
  {
    "id": "hautlence",
    "name": "Hautlence",
    "image": "https://watchbase.r.sizr.io/brand/md/hautlence-2d.jpg",
    "description": "HAUTLENCE is known and acknowledged for its original concepts in reading time. It adopts a think tank approach and brings a new vision to the art of watchmaking, while respecting its traditions.\n\nSince its creation in 2004, HAUTLENCE has been a brand in a league of its own. It plays with design codes just as it does with its name – an anagram of the city of Neuchâtel in tribute to the cradle... of watchmaking and to its expertise.\n\nWith surprising and sometimes unprecedented ways of reading the time, a powerful and easily identifiable design inspired by architectural principles, as well as a majority of in-house made calibres developed and crafted in its own Atelier, HAUTLENCE has earned within less than a decade the recognition of its peers, the trust of the most prestigious retailers, the enthusiasm of the most knowledgeable journalists, and a top spot on the wish list of collectors worldwide.\n\nIn 2012, its reputation was further strengthened by the arrival at the company helm of one of the industry’s most well-respected personalities, Georges-Henri Meylan. Together with brand Co-Founder Guillaume Tetu, they are currently writing one of the finest chapters in the history of alternative 21st century watchmaking, backed by a top-notch and highly motivated team and by the finest artisans of the region. HAUTLENCE is clearly going to make its mark on time.",
    "url": "http://www.hautlence.com/",
    "year": "2004"
  },
  {
    "id": "hermes",
    "name": "Hermès",
    "image": "https://watchbase.r.sizr.io/brand/md/hermes-b.png",
    "description": "",
    "url": "http://www.hermes.com",
    "year": "1937"
  },
  {
    "id": "hublot",
    "name": "Hublot",
    "image": "https://watchbase.r.sizr.io/brand/md/hublot-e9.png",
    "description": "",
    "url": "http://www.hublot.com",
    "year": "1980"
  },
  {
    "id": "ikepod",
    "name": "Ikepod",
    "image": "",
    "description": "",
    "url": "http://www.ikepod.com/"
  },
  {
    "id": "itay-noy",
    "name": "Itay Noy",
    "image": "https://watchbase.r.sizr.io/brand/md/itay-noy-3a.png",
    "description": "",
    "url": "http://www.itay-noy.com"
  },
  {
    "id": "iwc",
    "name": "IWC",
    "image": "https://watchbase.r.sizr.io/brand/md/iwc-2b.jpg",
    "description": "IWC is based in Schaffhausen, Switzerland, and was founded in 1868. Its signature lines are the Pilot's Watches and the Portugieser, while other famous collections are the Aquatimer, Portofino and the Da Vinci.\n\nMany of IWC's designs display a industrial type of beauty not often found in Swiss watchmaking. The same goes for its movements; while of very high standards, they are finished with an... engineers touch rather than that of an artist. One could very well say that IWC's approach to watchmaking is more German in nature compared to many of its competitors; the 'form follows function' adagio is one held in high esteem in Schaffhausen.\n\nNotable watches and innovations created by IWC in the past include the digital 'Pallweber' pocket watch, the late 1930's Portugieser, the 1985 Da Vinci with Kurt Klaus perpetual module, the split-seconds mechanism as designed by Richard Habring and the ceramic Da Vinci and Flieger 3705 - introduced many years before the material became fashionable. IWC also pioneered the use of titanium in wristwatches. In recent years, IWC has had a strong focus on in-house movements with prices rising accordingly.",
    "url": "http://www.iwc.com",
    "year": "1868"
  },
  {
    "id": "jaeger-lecoultre",
    "name": "Jaeger-LeCoultre",
    "image": "https://watchbase.r.sizr.io/brand/md/jaeger-lecoultre-44.png",
    "description": "",
    "url": "http://www.jaeger-lecoultre.com",
    "year": "1833"
  },
  {
    "id": "jaquet-droz",
    "name": "Jaquet Droz",
    "image": "https://watchbase.r.sizr.io/brand/md/jaquet-droz-2e.jpg",
    "description": "",
    "url": "http://www.jaquet-droz.com/"
  },
  {
    "id": "jeanrichard",
    "name": "JeanRichard",
    "image": "https://watchbase.r.sizr.io/brand/md/jeanrichard-4a.png",
    "description": "",
    "url": ""
  },
  {
    "id": "junghans",
    "name": "Junghans",
    "image": "https://watchbase.r.sizr.io/brand/md/junghans-d8.jpg",
    "description": "What began in 1861 in Schramberg, Germany, as the Junghans watch factory opened its doors quickly developed into one of the most compelling success stories in the history of the German watch industry. The demands placed on a timepiece may have evolved since then, but the Junghans philosophy has remained unchanged.\n\nStill today, an innovative spirit and the incessant pursuit of precision are the... key beliefs that drive all those who work at Junghans. Thanks to the vision and energy of the entrepreneurial Steim family from Schramberg, the company is now shining in fresh splendour.\n \nThis commitment to Schramberg as a location of business is apparent and tangible in every watch bearing the Junghans name.\n\nAs multifaceted as the Junghans portfolio is, a single uncompromising standard applies: to bring together traditional workmanship with state-of-the-art technology and truly exciting design. This is what makes every timepiece with the eight-point star so very unique, and what allows Junghans to proudly state: Junghans - The German Watch.",
    "url": "http://www.junghans.de/",
    "year": "1861"
  },
  {
    "id": "karoshi",
    "name": "Karoshi",
    "image": "https://watchbase.r.sizr.io/brand/md/karoshi-b8.png",
    "description": "",
    "url": "http://karoshiwatches.com/",
    "year": "2016"
  },
  {
    "id": "kobold",
    "name": "Kobold",
    "image": "https://watchbase.r.sizr.io/brand/md/kobold-85.png",
    "description": "",
    "url": "http://koboldwatch.com/",
    "year": "1998"
  },
  {
    "id": "l-and-jr",
    "name": "L & Jr",
    "image": "https://watchbase.r.sizr.io/brand/md/land-jr-dc.png",
    "description": "The product of bold ideas, long discussion and intense collaboration, L&JR is a thoroughly modern brand, driven by its founders’ shared desire to take a new approach to Swiss watchmaking, an approach designed for today’s world. A world where watches don’t merely tell time but speak volumes about their owners’ style and attitude. A fast-paced world that nevertheless values long-lasting... quality.\n \nWith deep experience in the watch industry, complementary skills and shared values, the three founders –  Philippe Cros, Lionel Ladoire and Jorg Hysek Jr – embarked on the adventure of creating watches together. The challenge they set themselves was to find the sweet spot between quality and price, originality and reliability, a love of horology and a sense of fun.\n \nAt the core of the brand lies the founders’ conviction that the owner of the watch – the wearer and user – should be at the heart of every idea. A principle that they have successfully translated into strong design, allied to high Swiss quality and great value for money – a sophisticated and contemporary definition of luxury.",
    "url": "http://landjr.com/"
  },
  {
    "id": "laco",
    "name": "Laco",
    "image": "https://watchbase.r.sizr.io/brand/md/laco-dc.png",
    "description": "",
    "url": "https://www.laco.de/",
    "year": "1925"
  },
  {
    "id": "lang-and-heyne",
    "name": "Lang & Heyne",
    "image": "https://watchbase.r.sizr.io/brand/md/lang-heyne-5d.jpg",
    "description": "Marco Lang is a fifth generation watchmaker. His father's workshop in Dresden was both his playground as well as his source of inspiration for his later creations.\n\nAfter five years of watchmaking school Lang began restoring and constructing movements, mainly high-precision clocks. After creating his 'Masterpiece' with the accompanying letter, he began his own workshop at age 27. His main area... of expertise was Saxonian pocketwatches from the 18th and 19th century.\n\nIn 2001 Lang began his own brand, called Lang & Heyne, wherein he is the head watchmaker, while a friend takes care of the entrepreneurial side of business. Today his base is a villa in Dresden, where he builds watches with a team of some 10 young watchmakers.",
    "url": "http://www.lang-und-heyne.de",
    "year": "2001"
  },
  {
    "id": "lebois-and-co",
    "name": "Lebois & Co",
    "image": "https://watchbase.r.sizr.io/brand/md/lebois-co-fd.png",
    "description": "",
    "url": "https://www.leboisandco.com/",
    "year": "2014"
  },
  {
    "id": "leroy",
    "name": "Leroy",
    "image": "https://watchbase.r.sizr.io/brand/md/l-leroy-c2.png",
    "description": "The L. Leroy brand considers itself the heir to an exceptional heritage, handed down through the generations since 1785. Over 220 years of history have shaped the House of L.Leroy, which has written some of the finest chapters in the history of French watchmaking and chronometry, supported in its endeavours by two dynasties of brilliant craftsmen, inspired as much by the applied arts as by... science.\n\nThe company philosophy is based on this extraordinary past, which daily nurtures its vision of the future. The L. Leroy brand aims to encapsulate the breadth of knowledge acquired in luxury watchmaking products, using avant-garde techniques and boasting timeless designs.\n\nThe name of the company was changed from L. Leroy to just Leroy in 2015.",
    "url": "http://www.montres-leroy.com/"
  },
  {
    "id": "limes",
    "name": "Limes",
    "image": "https://watchbase.r.sizr.io/brand/md/limes-4.png",
    "description": "Karl Ickler founded the Ickler family business in 1924. He had previously worked as head of the manufacturing department for foreign companies. With this treasure of experience, he founded his own watch case manufacture. In 1947, his two sons rebuilt production, which had lay fallow during the war.\n\nToday the company is managed by the third-generation Thomas Ickler.Ickler manufactures premiere... quality watches and watch cases, made to the highest quality standards, for a demanding international clientele - all made in Germany.\n\nIckler started making private label watches in 1990. With a desire to contribute their decades of experience in the watch industry, they began planning the LIMES brand a few years later.\n\nWith a fascination for fine, mechanical watches crafted mainly by hand, the concept was born: High quality mechanical movements combined with top grade Ickler made cases.\nThe LIMES collection includes the elegant Pharo family, the exclusive Chyros models and the sporty Endurance instrument watches.",
    "url": "http://www.limes-uhren.de/"
  },
  {
    "id": "linde-werdelin",
    "name": "Linde Werdelin",
    "image": "https://watchbase.r.sizr.io/brand/md/linde-werdelin-8a.jpg",
    "description": "",
    "url": "https://www.lindewerdelin.com"
  },
  {
    "id": "longines",
    "name": "Longines",
    "image": "https://watchbase.r.sizr.io/brand/md/longines-bc.png",
    "description": "",
    "url": "http://www.longines.com",
    "year": "1832"
  },
  {
    "id": "lundis-bleus",
    "name": "Lundis Bleus",
    "image": "https://watchbase.r.sizr.io/brand/md/lundis-bleus-eb.png",
    "description": "",
    "url": "http://lundis-bleus.com",
    "year": "2015"
  },
  {
    "id": "lytt-labs",
    "name": "Lytt Labs",
    "image": "https://watchbase.r.sizr.io/brand/md/lytt-labs-a6.png",
    "description": "Lytt labs is the brainchild of two founders and friends who conceived the idea in 2014. The lead founder and CEO has years of manufacturing experience for the top global brands, bringing his exacting and demanding standards to Lytt Labs watches and expanding the group to include an international team of professionals.\n\nUnrestricted by the rules of classic watchmaking nor heritage, the founders... set forth with a clear and simple vision - to provide a unique and forward-thinking approach to watchmaking, ensuring that each piece is both thought-provoking and a conversation starter.\n\nWith corporate inspirations defined, the first series of design creations were heavily influenced by urban environments and architecture. Indeed the play of light across the various surfaces of the Inception is reflective of the company’s underlying philosophy.\n\nLytt Labs broke into the industry in 2017 with the launch of the Inception V1.0 - a technical and vibrantly coloured timepiece with eye-catching details that gained immediate attention globally.\n\nIn 2018, the Inception V1.1 was released with design enhancements to the brand font, hour and minute discs. The addition of luminescent paint to all significant areas of the dial (numbers, markings, logo branding and indicator arrows) further enhanced visibility in the dark, exuding a sci-fi edge. These restrained touches add a crisper, more elegant quality to the overall aesthetic of the V1.1, creating a truly stunning watch.",
    "url": "https://lyttlabs.com/",
    "year": "2017"
  },
  {
    "id": "mbandf",
    "name": "MB&F",
    "image": "https://watchbase.r.sizr.io/brand/md/mb-f-fd.jpg",
    "description": "Based around one very simple and fundamental ideal: to assemble dedicated Collectives of talented horological artisans, artists and professionals – all friends – to design and craft each year a radical and original horological masterpiece.\n\nBy nurturing teams of talented individuals, harnessing their passion and creativity and crediting each individual's essential role, MB&F uses their... synergy to become much greater than the sum of its parts.\n\nMB&F is above all a human adventure... a human adventure with just one goal: to create incredible horological machines.",
    "url": "http://www.mbandf.com",
    "year": "2005"
  },
  {
    "id": "meistersinger",
    "name": "MeisterSinger",
    "image": "https://watchbase.r.sizr.io/brand/md/meistersinger-f.png",
    "description": "",
    "url": "http://www.meistersinger.com",
    "year": "2001"
  },
  {
    "id": "mido",
    "name": "Mido",
    "image": "https://watchbase.r.sizr.io/brand/md/mido-3b.jpg",
    "description": "",
    "url": "www.midowatches.com",
    "year": "1918"
  },
  {
    "id": "minase",
    "name": "Minase",
    "image": "https://watchbase.r.sizr.io/brand/md/minase-43.png",
    "description": "Looking back, the origin of MINASE was probably a single step drill.\nMINASE started with the question, “What type of watch could we make if we try to make the ideal watch using our original tools, which have come to be used by many watch manufacturers?”\n\nMINASE is based on Kyowa Co., Ltd., which was founded as a cutting tool manufacturer in 1963. The company first handled precision drills... for metal machining. Later, Kyowa’s expertise in drill manufacturing and metal cutting caught the attention of watch manufacturers, who asked us to produce a drill that could make a crown hole at one time. In Japan in those days, there were no drills that could make precise concentric stepped holes and that were highly wear-resistant. For this reason, Kyowa started to make its original step drills. Since then, our drills have been used for efficient, precise metal machining in various industries, although we did not think of making watches by ourselves at that time.\n\nTaking advantage of our original step drills, we entered the watch manufacturing industry and started the business of manufacturing watch cases in parallel with our tool business. We have created our own drills and jigs to meet the machining requirements of watch manufacturers’ designs. As we gained more experience in pressing and cutting, we naturally came to handle increasingly complicated watches.\nLater, we started to manufacture bracelets and cases not only for mass-produced watches, but also for high-quality ones, including those of world-famous watch manufacturers. High-quality watches necessarily require high-precision machining and fine polishing, and so we mastered polishing techniques. At first, we were only imitating others, but our pride as a tool manufacturer eventually drove Kyowa to become an expert watchmaker. Thus, Kyowa expanded its watch business from drilling to case cutting/forging, bracelet manufacturing, and polishing.\n\nWe have tools, we can make cases, we have carried out OEM of finished products. But we still want to make our ideal watches.\n\nTherefore, in 2005 we decided to establish our own new brand, MINASE. The brand name comes from the place name Minase in Akita Prefecture, where our workshop is located. Minase looks rather like Vallee de Joux, which is known as the birthplace of the Swiss watch industry. The snowy, remote location of Minase geographically restricts its residents, but it also increases their patience, which is essential for craftsmen. Having developed excellent tools and jigs, manufacturing know-how, and skilled craftsmen, we decided to make our ideal watches that would be treasured for more than 100 years.\n\nOur know-how accumulated through case manufacturing is still alive in MINASE today. Sallaz polishing, a substrate preparation technique for cases, is just one example. MINASE has learned the sallaz polishing technique which is unique to Japanese high-quality watches through manufacturing the exterior of high-quality watches. Thus, by meeting the challenging demands of watch manufacturers, in 1996 we became a general watch manufacturer engaged in design, development, and manufacturing.\n\nStarting from the Master Craft Series in 2005, we completed our goal with the HiZ Series in 2011. The complex design employing the MORE structure, sallaz polishing, case-in-case structure, etc. requires many exterior parts and makes manufacturing difficult. And yet we were determined to embody the spirit of “Japanese monozukuri” (Japanese art of making things) with our HiZ Series.\n\nOur challenge started from a single drill, and will continue into the future.\n\nIn 2017, the original movement was completed, and we will continue to line up models incorporating the original movement.",
    "url": "www.minasewatches.ch",
    "year": "2005"
  },
  {
    "id": "montblanc",
    "name": "Montblanc",
    "image": "https://watchbase.r.sizr.io/brand/md/montblanc-ec.gif",
    "description": "",
    "url": "http://www.montblanc.com",
    "year": "1997"
  },
  {
    "id": "montegrappa",
    "name": "Montegrappa",
    "image": "https://watchbase.r.sizr.io/brand/md/montegrappa-5f.png",
    "description": "",
    "url": "http://www.montegrappa.com"
  },
  {
    "id": "moritz-grossmann",
    "name": "Moritz Grossmann",
    "image": "https://watchbase.r.sizr.io/brand/md/moritz-grossmann-f1.png",
    "description": "",
    "url": "http://www.grossmann-uhren.com",
    "year": "2008"
  },
  {
    "id": "muhle-glashutte",
    "name": "Mühle Glashütte",
    "image": "https://watchbase.r.sizr.io/brand/md/muhle-glashutte-29.png",
    "description": "",
    "url": "http://www.muehle-glashuette.de/"
  },
  {
    "id": "mwandco",
    "name": "MW&Co",
    "image": "https://watchbase.r.sizr.io/brand/md/mw-co-a3.png",
    "description": "",
    "url": "http://mwandco.com"
  },
  {
    "id": "nomos-glashutte",
    "name": "Nomos Glashütte",
    "image": "https://watchbase.r.sizr.io/brand/md/nomos-glashutte-a7.png",
    "description": "",
    "url": "http://www.nomos-glashuette.com",
    "year": "1990"
  },
  {
    "id": "ollech-and-wajs",
    "name": "Ollech & Wajs",
    "image": "https://watchbase.r.sizr.io/brand/md/ollech-wajs-5a.png",
    "description": "",
    "url": "https://ow-watch.ch"
  },
  {
    "id": "omega",
    "name": "Omega",
    "image": "https://watchbase.r.sizr.io/brand/md/omega-8a.jpg",
    "description": "",
    "url": "http://www.omegawatches.com",
    "year": "1903"
  },
  {
    "id": "ophion",
    "name": "Ophion",
    "image": "",
    "description": "",
    "url": "http://www.ophion-watches.com/",
    "year": "2015"
  },
  {
    "id": "oris",
    "name": "Oris",
    "image": "https://watchbase.r.sizr.io/brand/md/oris-9a.jpg",
    "description": "",
    "url": "http://www.oris.ch",
    "year": "1904"
  },
  {
    "id": "panerai",
    "name": "Panerai",
    "image": "https://watchbase.r.sizr.io/brand/md/panerai-51.png",
    "description": "The history of Panerai began in 1860, when Giovanni Panerai opened his watchmaking shop at the Firenze Phone alle Grazie. The brand would move to Piazza San Giovanni somewhat later - the current Firenze Panerai Boutique is still located there.\n\nAlthough a specialist at watches, the Panerai firm would grow fame as a supplier of military instruments, including torches, compasses, depth meters and... others. In 1916 the first patent was filed for 'Radiomir', a luminescent substance that would increase the readability of dials of instruments and devices in dim light.\n\nIn 1936 the first prototype of a Radiomir-type dive watch was shown. Its oversized (47mm) case was fitted with wire-loop lugs and it featured a hand-wound movement. It was produced in cooperation with Rolex.",
    "url": "http://www.panerai.com",
    "year": "1860"
  },
  {
    "id": "parmigiani-fleurier",
    "name": "Parmigiani Fleurier",
    "image": "https://watchbase.r.sizr.io/brand/md/parmigiani-fleurier-39.jpg",
    "description": "",
    "url": "http://www.parmigiani.ch",
    "year": "1996"
  },
  {
    "id": "patek-philippe",
    "name": "Patek Philippe",
    "image": "https://watchbase.r.sizr.io/brand/md/patekphilippe-66.jpg",
    "description": "Patek Philippe has been perpetuating the tradition of Genevan watchmaking without interruption since May 1, 1839. As the last family-owned independent watch manufacturer in Geneva, it enjoys total creative freedom to entirely design, produce and assemble what experts agree to be the finest timepieces in the world – following the vision of its founders Antoine Norbert de Patek (1839) and Adrien... Philippe (1845). Thanks to its exceptional know-how, Patek Philippe maintains a tradition of innovation hailed by an impressive repertoire of more than 80 patents.",
    "url": "http://www.patek.com",
    "year": "1839"
  },
  {
    "id": "pequignet",
    "name": "Pequignet",
    "image": "https://watchbase.r.sizr.io/brand/md/pequignet-77.jpg",
    "description": "",
    "url": "http://www.pequignet.com/",
    "year": "1973"
  },
  {
    "id": "perrelet",
    "name": "Perrelet",
    "image": "https://watchbase.r.sizr.io/brand/md/perrelet-39.png",
    "description": "Ever since its founding, Perrelet has consistently innovated in the field of horology, displaying an audacity firmly rooted in its DNA and its values. The inventor of the self-winding watch almost 250 years ago, Perrelet has faithfully cultivated its pioneering, avant-garde spirit as well as impressive mastery of its timepiece developments. Key values such as rigorous technical standards as well... as extreme precision are placed in the service of a vision: that of perpetuating the watchmaking legacy of the brand’s legendary founder, Abraham-Louis Perrelet, as well as his successors such as Louis Frédéric Perrelet.",
    "url": "http://www.perrelet.com"
  },
  {
    "id": "pheidippides-watches",
    "name": "Pheidippides Watches",
    "image": "https://watchbase.r.sizr.io/brand/md/pheidippides-watches-7a.png",
    "description": "",
    "url": "www.pheidippides-watches.com",
    "year": "2015"
  },
  {
    "id": "piaget",
    "name": "Piaget",
    "image": "https://watchbase.r.sizr.io/brand/md/piaget-fb.jpg",
    "description": "It was in La Côte-aux-Fées, a small village in the Swiss part of the Jura, that Georges Édouard Piaget sketched the first strokes of what, decades later, was to become an inimitable signature in the world of luxury and fine watchmaking. In 1874, he started his first workshop on the family farm and devoted himself to making high-precision movements that he soon began supplying to the most... prestigious brands. The business developed very quickly. Piaget’s fame spread far beyond the crests of the mountains around Neuchâtel, increased by demand from those who already recognized his signature on a movement as a mark of seldom-equaled expertise, and his workshop grew.\n\nAn enterprising spirit, willingness to take risks and the desire never to rest on its laurels were indelibly inscribed on Piaget’s DNA, which is why in 1943 the company made a decision that was crucial to its future by registering the brand. From then on, the movement Manufacture from La Côte-aux-Fées produced watches signed by and sold under its own name, created with the same close attention to aesthetics and technical performance. This rebirth can be ascribed to Gérald and Valentin Piaget, the founder’s grandsons. They also started the brand’s geographic expansion and worked to increase its international recognition.\n\nOrders came pouring in and production was running at full capacity. Even though the workshops had been modernised, they could not keep pace with demand. That is why in 1945, Piaget built a new Manufacturing facility, which was soon to distinguish itself by novel developments in the area of ultra-thin movements\n\nFaithful to its pioneering spirit, Piaget began to design and build the ultra-thin movements that were to become one of the company’s “signatures”, making an enduring impression on the watchmaking world. In 1957, the Manufacture introduced the famous ultra-thin hand-wound Calibre 9P, which was only 2 mm thick. In 1960, Piaget launched the Calibre 12P, the world’s thinnest self-winding movement. It measured just 2.3 mm thick.\n\nThis mastery of the infinitely small was not simply an expression of unusual technical ability. Thanks to their thinness and reduced size, these two mechanical calibres and their successors offered Piaget’s designers completely new perspectives by opening up the possibility of all sorts of bold creative ideas: ultra-thin profiles, generously sized dials, coin watches, shaped cases, etc. The Manufacture used all of these opportunities to its best advantage by developing a number of creations that were to leave their mark on the history of contemporary watchmaking.\n\nPiaget’s supremacy in ultra-thin mechanical movements has earned the brand a special place among the great Swiss watchmakers. By mastering this area of expertise while elevating boldness and creativity to the status of primary values, it was bound to cause sparks to fly. These fireworks opened the doors to international recognition for Piaget and helped the brand make a name for itself in the world of fine watchmaking and precision work. In the 1960s, the company reiterated its desire to achieve ever-increasing control over its production by purchasing several goldsmiths’ workshops in Geneva.\n\nAfter the introduction of its world-first watches featuring dials made of hard stone, Piaget did it again with the launch of the cuff watch, which at once became a symbol of precious watchmaking. Creativity and the expression of difference became Piaget’s style signature. The brand inspired trends. And this was only the beginning.\n\nA brand does not become “the” standard for creativity without demonstrating a fresh, spontaneous approach to its art. Perhaps more than any other company, Piaget has risen to this challenge by pushing back the limits of watchmaking expertise toward new horizons marked by boldness and innovation. For Piaget, boldness means asserting its independence and handling extravagance with subtlety. It also means introducing models destined to make a mark on their own era and to stand the test of time. In 1979, the Manufacture launched the Piaget Polo watch. Avant-garde, yet classic enough never to go out of style, it quickly became an icon.\n\nA legendary model from then on, the Piaget Polo was to help give the brand a new international dimension and global recognition. The first watch to offer a bracelet completely integrated with the case, it demonstrated a kind of expertise that unites technical sophistication with aesthetic elegance. It was later to prove not only that this double characteristic would assure its unfailing success, but also that it had introduced a new way of thinking about timepieces that was adopted by the international jet-set.\n\nTo meet rapidly growing demand, the Manufacture in La Côte-aux-Fées strengthened its offer in mechanical movements by developing new movement lines: Calibres 430P and 500P. These replaced the historic ultra-thin 9P and 12P movements that had forged Piaget’s reputation in the ultra-thin field. In 1998, building on this broader range of mechanical movements, Piaget launched the Piaget Altiplano collection of ultra-thin watches – inspired by a vintage 1957 model – embodying purity, classicism and elegance, and introduced in 1999 the Piaget Emperador line destined to house the most sophisticated mechanical movements.\n\nThese watches are all inspired by the brand’s rich historical heritage, which they reinterpret in a forceful, distinctively modern way. Piaget’s deep-felt attachment to traditions and its expertise in movement manufacturing made it a natural choice for the city of Venice as a partner in restoring the Torre dell’Orologio on St. Mark’s Square, a legendary monument bearing eloquent testimony to the history of time measurement.\n\nIn order to keep pace with its growing success, in 2001 the company opened the new Manufacture de Haute Horlogerie Piaget in Plan-les-Ouates, just outside Geneva. This event consolidated a visionary integration strategy already undertaken by the company in the 1960s. This high-performance facility, regrouping both watchmaking and jewellery crafts, complements the historical site in la Côte-aux-Fées where the movements are made. At the same time, Piaget continued to invest in the domain of research and development.\n\nWithin barely a decade, almost 30 new movements were to be created, including some of the most prestigious horological complications, and notably a tourbillon, a dual time-zone flyback chronograph, and a perpetual calendar. Meanwhile, jewellery watches were endowed with innovative concepts adding further sparkle to the natural radiance of diamonds.\n\nAll these masterpieces are entirely in line with Piaget's proverbial inventiveness and emphatically reassert the founder's motto: \"Always do better than necessary\".\n\nThe fiftieth anniversary of the famous Calibre 12P launched in 1960 represented an opportunity for Piaget to reaffirm its unique expertise in the field of ultra-thin movements. In 2010, the company distinguished itself by setting a double record for the world’s thinnest self-winding movement and thinnest self-winding watch. Two years later, in 2012, and building on this accomplishment, it presented the skeleton version of this same movement, brilliantly exploring the fascinating art of openworking. This technical and aesthetic masterpiece represented a new double record for the House. The latter’s ongoing pursuit of new challenges in the demanding field of ultra-thin watchmaking stems from the premier importance it devotes to the elegance of its timepieces. This philosophy leads it to consistently push the boundaries of extreme slenderness, resulting in 2013 in an exceptional feat of fine watchmaking: the minute repeater.\n\nThis new 1290P Calibre measures a mere 4.8 mm thick, setting the record for thinness in its category, despite its 407 components. A breathtaking number of pieces, resulting in an exceptional miniaturisation without the slightest concession in sound or technical reliability. Drawing on the breadth of its fully integrated expertise, Piaget fuses technique and design now more than ever in jewellery and watchmaking.",
    "url": "www.piaget.com"
  },
  {
    "id": "pinion",
    "name": "Pinion",
    "image": "https://watchbase.r.sizr.io/brand/md/pinion-c6.png",
    "description": "",
    "url": "www.pinionwatches.com",
    "year": "2013"
  },
  {
    "id": "porsche-design",
    "name": "Porsche Design",
    "image": "https://watchbase.r.sizr.io/brand/md/porsche-design-95.jpg",
    "description": "",
    "url": "https://www.porsche-design.com/"
  },
  {
    "id": "prim",
    "name": "Prim",
    "image": "https://watchbase.r.sizr.io/brand/md/prim-a0.png",
    "description": "Prim has been manufacturing watches in Nove Mesto nad Metuji since 1949. They are a symbol of quality and proof of the craftsmanship of Czech watchmakers. Almost one thousand operations are performed in the ELTON hodinarska factory before more than 130 individual components are transformed into a wristwatch with a mechanical movement. The brand manufactures 99% of these components in-house.... Manufacturing of a complete mechanical wristwatch under one roof – that is something which less than ten factories in the whole world are able to do. Thanks to this unique ability, we can offer our customers almost unlimited possibilities in terms of meeting their specific requirements and desires.",
    "url": "https://www.prim.cz/"
  },
  {
    "id": "rado",
    "name": "Rado",
    "image": "https://watchbase.r.sizr.io/brand/md/rado-b.png",
    "description": "",
    "url": "http://www.rado.com",
    "year": "1957"
  },
  {
    "id": "ralph-lauren",
    "name": "Ralph Lauren",
    "image": "https://watchbase.r.sizr.io/brand/md/ralph-lauren-9.png",
    "description": "",
    "url": "http://www.ralphlauren.com",
    "year": "1967"
  },
  {
    "id": "ressence",
    "name": "Ressence",
    "image": "https://watchbase.r.sizr.io/brand/md/ressence-2d.jpg",
    "description": "",
    "url": "http://ressencewatches.com/",
    "year": "2010"
  },
  {
    "id": "rgm",
    "name": "RGM",
    "image": "",
    "description": "RGM Watch Company was founded in 1992 by American watchmaker Roland G. Murphy; ever since, he has been “making history in watchmaking” here in America. This simple phrase describes much of what takes place at RGM.\n\nWhile continually producing bespoke timepieces, such as the Caliber 801 and the Pennsylvania Tourbillon, RGM has kept the great traditions of fine watchmaking in focus. Modern... manufacturing co-exists with antique, hand-operated machinery. Hand-blued screws and hand-polished components are at home among the close tolerances afforded by automated machines. RGM's goal is to offer not only the finest watches made in the USA, but the finest watches available, and RGM believes this requires equal efforts to improve current methods while at the same time preserving tradition.\n\nRGM Watch Company is located in a small town in Lancaster, Pennsylvania, an area with a rich history of watchmaking in America’s past. The time-honored approach of dealing one-on-one with people is instilled in RGM, and is as much a reflection of where they live as where they work. RGM takes great pride in doing a job the right way while providing great value. RGM is proud of manufacturing watch parts, cases and movements in the USA.",
    "url": "http://www.rgmwatches.com"
  },
  {
    "id": "richard-mille",
    "name": "Richard Mille",
    "image": "https://watchbase.r.sizr.io/brand/md/richard-mille-85.png",
    "description": "Richard Mille was founded in 1999 by the French Richard Mille. Its first watch, the RM001, was introduced in 2001 and instantly catapulted Richard Mille to the highest echelons of watchmaking. The brand is best known for pairing decisively modern designs with highly intricate (and no less modern) mechanical movements - the latter either developed in cooperation with [Audemars Piguet] Renaud &... Papi or sourced from Vaucher.",
    "url": "http://www.richardmille.com/",
    "year": "1999"
  },
  {
    "id": "rolex",
    "name": "Rolex",
    "image": "https://watchbase.r.sizr.io/brand/md/rolex-bc.png",
    "description": "Pioneer of the wristwatch since 1905, Rolex is at the origin of landmark innovations in watchmaking, including the first waterproof wristwatch - the Oyster - and the Perpetual rotor self-winding mechanism. For over a century, Rolex watches have accompanied explorers and achievers around the world, from the top of the highest mountains to the deepest reaches of the ocean.\n\nThe history of Rolex... is inextricably linked to the visionary spirit of Hans Wilsdorf, its founder. In 1905, at the age of 24, Hans Wilsdorf founded a company in London specialising in the distribution of timepieces. He began to dream of a watch worn on the wrist. Wristwatches were not very precise at the time, but Hans Wilsdorf foresaw that they could become not only elegant, but also reliable. To convince the public of the reliability of his resolutely innovative timepieces, he equipped them with small, very precise movements manufactured by a Swiss watchmaking company in Bienne.\n\nHans Wilsdorf wanted his watches to bear a name that was short, easy to say and remember in any language, and which looked good on watch movements and dials. He said, “I tried combining the letters of the alphabet in every possible way. This gave me some hundred names, but none of them felt quite right. One morning, while riding on the upper deck of a horse-drawn omnibus along Cheapside in the City of London, a genie whispered ‘Rolex’ in my ear.”\n\nRolex first concentrated on the quality of the movements. The relentless quest for chronometric precision rapidly led to success. In 1910, a Rolex watch was the first wristwatch in the world to receive the Swiss Certificate of Chronometric Precision, granted by the Official Watch Rating Centre in Bienne. Four years later, in 1914, Kew Observatory in Great Britain awarded a Rolex wristwatch a class “A” precision certificate, a distinction which until that point in time had been reserved exclusively for marine chronometers. From that date forward, the Rolex wristwatch was synonymous with precision. Rolex moved to Geneva, a city renowned internationally for watchmaking. Montres Rolex S.A. was registered in Geneva in 1920.\n\nIn 1926, the creation by Rolex of the first waterproof and dustproof wristwatch marked a major step forward. Given the name “Oyster”, this watch featured a hermetically sealed case which provided optimal protection for the movement.  It is one thing to claim a watch is waterproof. It is quite another to prove it. In 1927 a Rolex Oyster crossed the English Channel, worn by a young English swimmer named Mercedes Gleitze. The swim lasted over 10 hours and the watch remained in perfect working order at the end of it. To celebrate the crossing of the channel, Rolex published a full-page ad on the front page of the Daily Mail proclaiming the success of the waterproof watch. This event marked the birth of the Testimonee concept. \n\nIn 1931, Rolex invented and patented the world's first self-winding mechanism with a Perpetual rotor. This ingenious system, a true work of art, is today at the heart of every modern automatic watch. Rolex recognised the formidable opportunity to test, fine‑tune and showcase the technical performance of the Oyster in different arenas. The worlds of sport, aviation, motor racing and expeditions constituted living laboratories for the watches' countless technical attributes. In the 1930s, Rolex and one of the fastest drivers in the world, Sir Malcolm Campbell, became united by the quest for speed. On 4 September 1935, at the wheel of Bluebird – and wearing a Rolex watch – this “king of speed” set a land speed record of over 300 miles per hour (approximately 485 km/h) at Bonneville Salt Flats in Utah. Sir Malcolm broke the world speed record nine times between 1924 and 1935, including five times at Daytona Beach in Florida.\n\nThe year 1945 saw the birth of the Datejust, the first self‑winding wrist chronometer to indicate the date in a window on the dial. A watch of great distinction, the Datejust was equipped with a Jubilee bracelet created specially for it and a fluted bezel, making it immediately recognisable as a Rolex. It is the pillar of the Oyster collection. Initially for men, it became available in various models for women in the course of the following decade.\n\nIn the early 1950s, Rolex developed professional watches that served as tools and whose functions went far beyond simply telling the time. These watches were intended for professional activities, such as deep-sea diving, aviation, mountain climbing and scientific exploration. The watches generated lasting enthusiasm and became known as the watches of achievers. In 1953, Sir John Hunt’s expedition, in which Sir Edmund Hillary and Tenzing Norgay reached the summit of Mount Everest, was equipped with Oyster Perpetuals. Inspired by knowledge gained from this fascinating chapter of human adventure, the Oyster Perpetual Explorer, launched in 1953 to celebrate the victorious ascent of Everest, immediately acquired iconic status. Also launched in 1953, the Submariner was the first divers’ watch waterproof to a depth of 100 metres (330 feet). Its rotatable bezel allows divers to read their immersion time.\n\nAs intercontinental travel developed in the 1950s, airliners began to fly swiftly across several successive time zones. For the first time it became important to know the time in various places in the world, simultaneously. It was the dawn of the jet age, and Rolex responded with a watch to match the spirit of the times. The GMT-Master was developed to meet the specific needs of airline pilots. It became the official watch of several airlines, among them the famous Pan American World Airways, better known as Pan Am. Its most distinguishing visual feature was the two-tone bezel which marked daytime from nighttime hours.\n\nIn 1956, the Oyster Perpetual Day-Date made its debut. Available only in 18 ct gold or platinum, it was the first wristwatch to display the date and day of the week spelt out in full in a window on the dial. With the President bracelet, originally created specially for it, the Day-Date continues to be the watch par excellence of influential people.\n\nThe European Organization for Nuclear Research (CERN), the world's pre-eminent particle physics laboratory, is at the cutting edge of scientific research into the fundamental secrets of the universe. It hosts the world's highest-energy particle accelerator. In the 1950s, CERN was also one of the first scientific institutions to confirm that the Milgauss watch could indeed resist magnetic fields of up to 1,000 gauss. The Milgauss, introduced in 1956, was designed to meet the demands of the scientific community and is capable of withstanding magnetic fields of up to 1,000 gauss. The major innovation at the heart of the Milgauss' incredible resistance to magnetic interferences is the shield protecting the movement.\n\nThe Lady-Datejust was the first ladies’ version of the Rolex date chronometer, carrying its heritage of timeless elegance and functionality in a smaller size perfectly suited to a lady’s wrist. In the 1950s, Rolex carried out rigorous testing of an experimental watch, called “Deep Sea Special”. Using the knowledge gained from the making of the ﬁrst two models, the third Deep Sea Special was created to withstand the most extreme conditions - the Challenger Deep portion of the Mariana Trench. In 1960, the experimental bathyscaphe, the Trieste, successfully descended into the Mariana Trench, the deepest known depression on the Earth's surface. With Lieutenant Don Walsh at the helm, accompanied by Jacques Piccard, the Trieste accomplished a feat so incredible that it forever raised the bar for deep-ocean exploration.\n\nDaytona Beach, Florida. Long, flat and firm, with hard-packed sand, the beach helped the city of Daytona to forge a legend as the world capital of speed. It boasts 14 world land speed records set between 1904 and 1935, five of them by Rolex-wearer Sir Malcolm Campbell. Over the years, the sand deteriorated. By 1959, a “Super Speedway” was built: the Daytona International Speedway. Launched in 1963 as a new-generation chronograph, the Cosmograph soon gained the name that became the mark of an icon: Daytona. Designed as the ultimate tool for endurance racing drivers, the Cosmograph Daytona was robust, waterproof and featured a tachymetric scale on the bezel for calculating average speed.\n\n1967 saw the launch of the Oyster Perpetual Sea-Dweller, waterproof to a depth of 610 metres. To meet the needs of professional deep-sea divers, the case was equipped with a helium escape valve so that, during long decompression phases in hyperbaric chambers, the helium from the gas mixtures used could be released without risking damage to the watch. \n\nIn 1971 Rolex presented the Oyster Perpetual Explorer II, dedicated to polar explorers, speleologists, and all those pushing the boundaries of exploration. The watch featured a distinctive 24-hour hand, an invaluable aid around the poles and beneath ground when you can't tell night from day.\n\nRolex became the first watchmaking brand to pioneer the use of 904L for the cases of all its steel watches. Most commonly used in high‑technology and in the aerospace and chemical industries, its excellent anti-corrosion properties are comparable to those of precious metals and it offers a final polish of exceptional sheen.\n\nThe year 1992 heralded the arrival of the Oyster Perpetual Yacht-Master, the first watch in the Professional Oyster collection to be available in three sizes – 29, 35 and 40 mm. This new member of the Oyster family reinforced the ties between Rolex and the sailing world.\n\nIntroduced in 2007, the Oyster Perpetual Yacht-Master II regatta chronograph is the first watch in the world equipped with a programmable countdown with a mechanical memory. This unique watchmaking complication consists of an innovative system of interaction between the movement and the case thanks to a rotatable ring command bezel designed and developed by Rolex. This regatta chronograph allows yachtsmen to cross the line as soon as possible after the starting gun.\n\nAs one of its latest feats, Rolex presented a brand new innovative model, the Oyster Perpetual Sky-Dweller in 2012, a technological masterpiece intended for world travellers. In an impressive 42 mm case, it offers a dual time zone as intuitive to read as it is easy to use, as well as a particularly innovative annual calendar named Saros – in tribute to the astronomical phenomenon which inspired it – that requires only one date adjustment a year. To set its functions quickly and easily, it is also equipped with a new interface: the rotatable Ring Command bezel.\n\nOn March 26th, 2012, filmmaker and National Geographic Explorer‑in‑Residence James Cameron descended into the Mariana Trench, making the first solo dive into the deepest point on earth, and the only dive into the trench since the two-man Trieste expedition of 1960. Only one passenger was on both voyages: a Rolex watch. The Oyster Perpetual Rolex Deepsea Challenge is an experimental diving watch certified waterproof up to 12,000 metres (39,370 feet), entirely designed and built by Rolex to resist the extreme pressure in the deepest reaches of the oceans. Setting the record for the deepest diving watch in the world.",
    "url": "http://www.rolex.com",
    "year": "1908"
  },
  {
    "id": "seiko",
    "name": "Seiko",
    "image": "https://watchbase.r.sizr.io/brand/md/seiko-89.png",
    "description": "",
    "url": "http://www.seikowatches.com/",
    "year": "1881"
  },
  {
    "id": "sevenfriday",
    "name": "SevenFriday",
    "image": "https://watchbase.r.sizr.io/brand/md/sevenfriday-85.png",
    "description": "",
    "url": "http://www.sevenfriday.com"
  },
  {
    "id": "sinn",
    "name": "Sinn",
    "image": "https://watchbase.r.sizr.io/brand/md/sinn-c3.jpg",
    "description": "The name Sinn Spezialuhren stands for highly functional mechanical watches. Their pilot watches, diving watches, chronographs and Mission Timer (Einsatzzeitmesser / EZM) are designed to impress not only pilots, divers, and the German federal police special force GSG 9 (Grenzschutzgruppe 9). SINN watches continuously prove their toughness, durability, high quality and precision in both everyday... and extreme situations. These characteristics are due in no small part to the incorporation of their special technologies including DIAPAL, Ar-Dehumidifying Technology, HYDRO and TEGIMENT. When Sinn Spezialuhren develops a new watch, its form is always dictated by the required function.",
    "url": "https://www.sinn.de",
    "year": "1961"
  },
  {
    "id": "speake-marin",
    "name": "Speake-Marin",
    "image": "https://watchbase.r.sizr.io/brand/md/speake-marin-3.jpg",
    "description": "Peter Speake-Marin was born Peter Neville Speake in 1968 in Essex, England, to an English mother and Welsh father. When Peter reached the end of his secondary school education, he originally had the intention of entering the world of jewelry.  However, after a visit to a kindly careers teacher, Peter entered the world of watchmaking. He began his horological education at Hackney Technical College... in London in 1985 and then continued his studies at WOSTEP, the prestigious Swiss watchmaking school in Neuchâtel. Having completed the WOSTEP high-end complications course, Peter returned to England. He was eventually employed by Somlo Antiques then based in the Piccadilly arcade, London where he was tasked with establishing the watch restoration department of this prestigious antiques house.\n\nDuring seven years at Somlo, Peter had the privilege of restoring antique watches made by many of the great historical masters and brands, such as pieces by Arnold, Frodsham and Nielson, original Breguets and Patek Philippes – from the dawn of watchmaking through to the 1950s. Through this experience, Peter learnt how past masters had found their watchmaking solutions and their diverse ways of making watches, and he fell in love with this intoxicating combination of history, art and mechanics. \nIn 1996, he married, changing his name from Speake to Speake-Marin, before he and his wife moved to Le Locle, Switzerland where he worked for Renaud & Papi to help develop and build high-end complications as well as train young watchmakers. In his spare time, Peter began acquiring his own machinery and constructed by hand a tourbillon pocket watch with twin power trains, which later became known as the “Foundation Watch”– the foundation stone for his future work – and helped him earn coveted membership of the prestigious Académie Horlogère des Créateurs Indépendants (AHCI). In the “Foundation Watch”, Peter laid down his style and philosophy while establishing his first independent workshop at the beginning of the millennium on the picturesque Lake Geneva between Geneva and Lausanne.\n\nThe first wristwatch to leave his workshop at the end of 2003 took its cues from the Foundation Watch. Peter named its distinctive case “The Piccadilly” after the time he spent at Somlo in Piccadilly and the major influence that this period of his career had on his watchmaking outlook. As an independent, he has collaborated as a watchmaker designer and consultant with many different companies including Harry Winston, MB&F and Maîtres du Temps. Since the beginning of 2008 he has channelled his efforts exclusively into Speake-Marin.\n\nWith all Speake-Marin watches there is a tangible link to classical watchmaking but with contemporary unique style and design. Peter Speake-Marin’s timepieces are very much a representation of himself as a watchmaker, reinventing horology in his own way. There are very few modern watchmakers and brands that have created such an original style, adhered to such an underlying philosophy of constant excellence, beauty and longevity of design and aesthetics, to create timepieces that will endure.",
    "url": "http://www.speake-marin.com"
  },
  {
    "id": "staudt",
    "name": "Staudt",
    "image": "https://watchbase.r.sizr.io/brand/md/staudt-aa.png",
    "description": "",
    "url": "https://www.staudt-twenthe.com",
    "year": "2014"
  },
  {
    "id": "steinhart",
    "name": "Steinhart",
    "image": "https://watchbase.r.sizr.io/brand/md/steinhart-31.gif",
    "description": "",
    "url": "http://www.steinhartwatches.de/"
  },
  {
    "id": "stowa",
    "name": "Stowa",
    "image": "https://watchbase.r.sizr.io/brand/md/stowa-64.jpg",
    "description": "",
    "url": "https://www.stowa.de"
  },
  {
    "id": "stuckx",
    "name": "Stuckx",
    "image": "https://watchbase.r.sizr.io/brand/md/stuckx-d5.png",
    "description": "The Stuckx story is a simple one. Having been selling watches made by other great micro brands for many years, it was time to create a brand founder Stephan Trimbos could call his own. According to Stephan, it was like an urge: once he had formed some ideas, he just had to follow through with them! Stuckx makes watches to fulfill a dream and for the positive energy that this gives. Watches that... create a positive spark in the minds of connoisseurs and watch freaks.\n\nStuckx has a very intense relationship with its designer. The company started with defining what would become its key elements: 70's inspired, colors, both basic and more extremely outside the box, \"challenging\" designs. They then asked the designer to not hold back; to draw what he thought was great. Together they selected the first concepts and work began. Finalizing drawings, making manufacturing plans, selecting components.",
    "url": "http://stuckx.com/",
    "year": "2015"
  },
  {
    "id": "swatch",
    "name": "Swatch",
    "image": "https://watchbase.r.sizr.io/brand/md/swatch-6f.png",
    "description": "",
    "url": "http://www.swatch.com"
  },
  {
    "id": "sye",
    "name": "SYE",
    "image": "https://watchbase.r.sizr.io/brand/md/sye-5e.png",
    "description": "",
    "url": "https://www.syewatches.com/"
  },
  {
    "id": "tag-heuer",
    "name": "TAG Heuer",
    "image": "https://watchbase.r.sizr.io/brand/md/tag-heuer-ec.png",
    "description": "",
    "url": "http://www.tagheuer.com",
    "year": "1860"
  },
  {
    "id": "tissot",
    "name": "Tissot",
    "image": "https://watchbase.r.sizr.io/brand/md/tissot-b2.png",
    "description": "",
    "url": "http://www.tissot.ch",
    "year": "1853"
  },
  {
    "id": "tudor",
    "name": "Tudor",
    "image": "https://watchbase.r.sizr.io/brand/md/tudor-53.jpg",
    "description": "The Tudor trademark was registered in 1926 by the house of “Veuve de Philippe Hüther”, a watch dealer and maker. Hans Wilsdorf, founder of the Rolex watch company, acquired the exclusive usage rights. A decade later he took over the brand in its entirety. After the dark shadow of World War II was cast Mr. Wilsdorf knew the time had come to give the brand a proper identity of its own. Still,... Rolex would guarantee the technical, aesthetic and functional characteristics as. Their logo on the cases, crowns and bracelets testified to this.\n\nThe following decades would see Tudor offer a wide range of timepieces that paired elegance and robustness with excellent value-for-money. Notable collections include the Submariner (since 1954) and the bold Oysterdate chronographs (since 1970). Starting from 1996 Tudor, at the tender age of 50, was ready to stand on its own feet and all references to Rolex were gradually removed from the watches.\n\nIn 2010 Tudor launched the Heritage Chronograph, a bold new take on a 1970’s classic. It garnered international appraise and introduced the brand to a new generation of collectors. The next step followed in 2012 with the Black Bay, a dive watch that blended various influences from the past into a modern classic. When an in-house movement was introduced in 2015 the deal was sealed. A new Tudor emerged. Bold, daring and cool.",
    "url": "www.TudorWatch.com"
  },
  {
    "id": "twco",
    "name": "TWCO",
    "image": "https://watchbase.r.sizr.io/brand/md/twco-7d.jpg",
    "description": "TWCO is a Dutch watch brand founded in 2012. It is founded by Robbert Suurland, who took over the former spanning brand. TWCO designed a limited edition watch for the Spanish sea rescue service but that was the end of the brand. In 2012, Robbert Suurland took over TWCO and it has been under his control ever since. He designs the watches himself. TWCO currently (October 2016) has 3 different... models with in total 5 different watches.",
    "url": "http://www.twcowatches.com",
    "year": "2012"
  },
  {
    "id": "ulysse-nardin",
    "name": "Ulysse Nardin",
    "image": "https://watchbase.r.sizr.io/brand/md/ulysse-nardin-28.png",
    "description": "",
    "url": "http://www.ulysse-nardin.com/",
    "year": "1846"
  },
  {
    "id": "unimatic",
    "name": "Unimatic",
    "image": "https://watchbase.r.sizr.io/brand/md/unimatic-b6.png",
    "description": "",
    "url": ""
  },
  {
    "id": "urwerk",
    "name": "Urwerk",
    "image": "https://watchbase.r.sizr.io/brand/md/urwerk-74.png",
    "description": "Felix Baumgartner (co-founder and master watchmaker) and Martin Frei (co-founder and chief designer) first met in 1995 to discuss developing a watch. The young men were united by their common passion for measuring and portraying time. A long discussion, a sharing of philosophies and dreams, culminated in a decision to create their own vision of time.\n\nThey founded URWERK in 1997 and presented... their first timepiece with the AHCI at Baselworld that same year.",
    "url": "http://www.urwerk.com",
    "year": "1995"
  },
  {
    "id": "vacheron-constantin",
    "name": "Vacheron Constantin",
    "image": "https://watchbase.r.sizr.io/brand/md/vacheron-constantin-7d.jpg",
    "description": "",
    "url": "http://www.vacheron-constantin.com",
    "year": "1755"
  },
  {
    "id": "van-der-gang-watches",
    "name": "Van der Gang Watches",
    "image": "https://watchbase.r.sizr.io/brand/md/van-der-gang-watches-e6.jpg",
    "description": "",
    "url": "http://www.vandergangwatches.nl"
  },
  {
    "id": "victorinox",
    "name": "Victorinox",
    "image": "https://watchbase.r.sizr.io/brand/md/victorinox-12.jpg",
    "description": "",
    "url": "http://www.victorinoxwatches.com/"
  },
  {
    "id": "wempe-glashutte-isa",
    "name": "Wempe Glashütte I/SA",
    "image": "https://watchbase.r.sizr.io/brand/md/wempe-glashutte-i-sa-96.png",
    "description": "",
    "url": "https://www.wempe.com/"
  },
  {
    "id": "wyler-geneve",
    "name": "Wyler Geneve",
    "image": "https://watchbase.r.sizr.io/brand/md/wyler-geneve-cc.jpg",
    "description": "",
    "url": ""
  },
  {
    "id": "zeitwinkel",
    "name": "Zeitwinkel",
    "image": "https://watchbase.r.sizr.io/brand/md/zeitwinkel-22.jpg",
    "description": "",
    "url": "http://www.zeitwinkel.ch",
    "year": "2006"
  },
  {
    "id": "zenith",
    "name": "Zenith",
    "image": "https://watchbase.r.sizr.io/brand/md/zenith-fc.jpg",
    "description": "",
    "url": "http://www.zenith-watches.com",
    "year": "1865"
  }
]
